elot-label-display.org
#+title: label-display for ELOT

* Code
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./elot-package/elot-label-display.el :noweb yes
:END:

** Header for the elisp file
Block native compilation with ~no-native-compile: t;~. This (apparently)
allows for local variables to be accessed -- relevant for
~org-link-abbrev-alist-local~, which is needed for abbreviation of URIs
in SPARQL select results.
#+name: src-package-header
#+begin_src emacs-lisp :comments nil
  ;;; elot-label-display.el --- Emacs Literate Ontology Tool (ELOT): Label display   -*- lexical-binding: t; -*-

  ;; Copyright (C) 2024, 2025 Johan W. Klüwer

  ;; Author: Johan W. Klüwer <johan.w.kluwer@gmail.com>
  ;; URL: https://github.com/johanwk/elot
  ;; Version: 2.0.0

  ;; This file is not part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; This file allows for displaying rdfs:label strings instead of
  ;; resource identifiers while editing an ontology with ELOT.

  ;; By default for ELOT, switching between display of identifiers and
  ;; labels is assigned to the F5 key.

  ;; By default, labels are updated when your file is saved to disk.
  ;; You can also update labels with M-x `elot-label-display-setup'.

  ;;; Code:
#+end_src

** Require ~elot~ library
#+name: src-require
#+begin_src emacs-lisp
;; No external dependencies -- ht/dash removed; using built-in gethash.
(require 'elot-tangle)
#+end_src
*** Declare ~org-link-abbrev-alist-local~ to allow native compile
This is a safeguard, unclear whether it matters.
#+name: src-defvar
#+begin_src emacs-lisp
(defvar org-link-abbrev-alist-local)
#+end_src

** Function to be replaced
~elot-org-link-search~ is in use in elot-defs.org, but only during export to OMN. It's otherwise obsolete.
#+begin_src emacs-lisp
  (defun elot-org-link-search (&rest strings)
    "Search for an :ID: heading in current buffer.
  The concatenation of STRINGS is searched.  If found, move point there
  and return position.  If not found, return nil and leave point unchanged."
    (let ((pos (save-excursion
                 (goto-char (point-min))
                 (re-search-forward (concat ":ID:\\s-*"
                                            (apply #'concat strings)
                                            "\\s-*$")
                                    nil :noerror))))
      (when pos
        (goto-char pos))
      pos))
#+end_src

** Retrieve all entities defined in the buffer into list
The data-building functions (~elot-build-slurp~, ~elot-slurp-to-vars~,
~elot-codelist-from-slurp~, ~elot-attriblist-from-slurp~) now live in
=elot-tangle.el= and are available via =(require 'elot-tangle)=.

The old functions (~elot-entities-with-plist~, ~elot-slurp-entities~)
and the old versions of ~elot-codelist-from-slurp~ /
~elot-attriblist-from-slurp~ have been removed.

Results will look like this: three entries, id, label, and plist of
annotations. /Update/: added also "rdfs:label" to the plist.
#+begin_example
(("obo:BFO_0000001" "entity"
  ("rdf:type" "owl:Class" "dc11:identifier" "001-BFO" "skos:definition" "\"(Elucidation) An entity is anything that exists or has existed or will exist\"@en" "skos:example" "\"Julius Caesar; the Second World War; your body mass index; Verdi's Requiem\"@en"))
 ("obo:BFO_0000002" "continuant"
  ("rdf:type" "owl:Class" "dc11:identifier" "008-BFO" "skos:definition" "\"(Elucidation) A continuant is an entity that persists, endures, or continues to exist through time while maintaining its identity\"@en" "skos:example" "\"A human being; a tennis ball; a cave; a region of space; someone's temperature\"@en" "SubClassOf" "obo:BFO_0000001" "SubClassOf" "obo:BFO_0000176 only obo:BFO_0000002" "DisjointWith" "obo:BFO_0000003"))
 ("obo:BFO_0000031" "generically dependent continuant"
  ("rdf:type" "owl:Class" "dc11:identifier" "074-BFO" "skos:altLabel" "\"g-dependent continuant\"@en" "skos:definition" "\"(Elucidation) A generically dependent continuant is an entity that exists in virtue of the fact that there is at least one of what may be multiple copies which is the content or the pattern that multiple copies would share\"@en" "skos:example" "\"The pdf file on your laptop; the pdf file that is a copy thereof on my laptop; the sequence of this protein molecule; the sequence that is a copy thereof in that protein molecule; the content that is shared by a string of dots and dashes written on a page and the transmitted Morse code signal; the content of a sentence; an engineering blueprint\"@en" "SubClassOf" "obo:BFO_0000002"))

#+end_example
** Use local variables ~elot-slurp~
The data variables (~elot-slurp~, ~elot-slurp-global~, ~elot-codelist-ht~,
~elot-attriblist-ht~) are now declared in =elot-tangle.el= (via
=elot-tangling.org=), since that is where they are populated.

The display toggle variable remains here, as it is display-specific.
#+name: src-slurp-local-vars
#+begin_src emacs-lisp
  (defvar-local elot-label-display 'off
    "Value says `off' or `on' to showing labels for RDF resources.")
#+end_src

** Make a hash table ~elot-id-label-ht~
Note that we use ~elot--ht-from-plist~ for the id--label list, and ~elot--ht-from-alist~ for id--plist.
These helper functions use built-in ~puthash~ / ~gethash~ -- no external dependencies.

~elot-slurp-to-vars~ is now defined in =elot-tangle.el= (via
=elot-tangling.org=).  It calls ~elot-build-slurp~ instead of the old
~elot-slurp-entities~.

** Access the values
#+name: src-slurp-get
#+begin_src emacs-lisp
  (defun elot--strip-lang-tag (s)
    "Strip quotes and language/datatype tags from string S like \"abc\"@en."
    (if (and (stringp s) (string-prefix-p "\"" s))
        (replace-regexp-in-string "^\"\\([^\"]+\\)\".*" "\\1" s)
      s))
  (defun elot-codelist-id-label (idstring)
    "Given curie IDSTRING, return label if found.
  Two-tier lookup: local `elot-codelist-ht' first, then the ELOT label
  DB (`elot-db-get-label-any') if available and not found locally."
    (or (and (hash-table-p elot-codelist-ht)
             (elot--strip-lang-tag (gethash idstring elot-codelist-ht)))
        (and (fboundp 'elot-db-get-label-any)
             (fboundp 'sqlite-open)
             (ignore-errors (elot-db-get-label-any idstring)))))
  (defun elot-attriblist-label-value (idstring prop)
    "Given label IDSTRING and PROP, return value if found.
  Two-tier: local `elot-attriblist-ht' first, then `elot-db-get-attr'
  if available."
    (or (and (hash-table-p elot-attriblist-ht)
             (plist-get (gethash idstring elot-attriblist-ht) prop 'equal))
        (and (fboundp 'elot-db-get-attr)
             (fboundp 'sqlite-open)
             (ignore-errors (elot-db-get-attr idstring prop)))))
#+end_src
** TODO Regexp that matches the found identifiers
Sometimes the regex becomes too complex. Then we can fall back to just
matching the puri pattern. TODO: Find a test to check whether it's too
complex, and if so use something simpler.

We define a local variable for the regexp, and populate from the
identifiers using ~regexp-opt~.
#+name: src-codelist-regexp
#+begin_src emacs-lisp
  (defvar elot-codelist-fontify-regexp
    "\\<\\([-a-z_A-Z0-9]*\\):\\([a-z_A-Z0-9.-]*\\)\\>"
    "A regular expression used to match identifiers, for use with label-display.")

  (defun elot-update-codelist-fontify-regexp ()
    "Populate `elot-codelist-fontify-regexp'.

  • First try to build a tight union-of-identifiers regexp with
    `regexp-opt' and *eagerly* compile it once.
  • If compilation signals “regular expression too big” (or any other
    error), fall back to a generic CURIE pattern:

    \"\\\\<\\\\([-a-z_A-Z0-9]*\\\\):\\\\([a-z_A-Z0-9.-]*\\\\)\\\\>\"

  This guarantees that the value stored is always usable during
  font-lock and export."
    (let ((fallback "\\<\\([-a-z_A-Z0-9]*\\):\\([a-z_A-Z0-9.-]*\\)\\>"))
      (condition-case err
          (progn
            (unless (listp elot-slurp)
              (error "List of resources `elot-slurp' is missing"))

            ;; Build the precise regexp …
            (let* ((ids (flatten-tree (mapcar #'car elot-slurp)))
                   (precise (regexp-opt ids)))

              ;; … and *force* Emacs to compile it once.  Any size error
              ;; happens right here.
              (string-match-p precise "")

              ;; If we got here, it’s safe to use.
              (setq elot-codelist-fontify-regexp precise)))

        (error
         (message "elot: %s – using generic CURIE regexp." (error-message-string err))
         (setq elot-codelist-fontify-regexp fallback)))))
#+end_src
