elot-package/elot-label-display.el
;;; elot-label-display.el --- Emacs Literate Ontology Tool (ELOT): Label display   -*- lexical-binding: t; -*-

;; Copyright (C) 2024, 2025 Johan W. Klüwer

;; Author: Johan W. Klüwer <johan.w.kluwer@gmail.com>
;; URL: https://github.com/johanwk/elot
;; Version: 2.0.0

;; This file is not part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;; This file allows for displaying rdfs:label strings instead of
;; resource identifiers while editing an ontology with ELOT.

;; By default for ELOT, switching between display of identifiers and
;; labels is assigned to the F5 key.

;; By default, labels are updated when your file is saved to disk.
;; You can also update labels with M-x `elot-label-display-setup'.

;;; Code:

;; No external dependencies -- ht/dash removed; using built-in gethash.
(require 'elot-tangle)

(defvar org-link-abbrev-alist-local)

(defun elot-org-link-search (&rest strings)
  "Search for an :ID: heading in current buffer.
The concatenation of STRINGS is searched.  If found, move point there
and return position.  If not found, return nil and leave point unchanged."
  (let ((pos (save-excursion
               (goto-char (point-min))
               (re-search-forward (concat ":ID:\\s-*"
                                          (apply #'concat strings)
                                          "\\s-*$")
                                  nil :noerror))))
    (when pos
      (goto-char pos))
    pos))

(defvar-local elot-label-display 'off
  "Value says `off' or `on' to showing labels for RDF resources.")

(defun elot--strip-lang-tag (s)
  "Strip quotes and language/datatype tags from string S like \"abc\"@en."
  (if (and (stringp s) (string-prefix-p "\"" s))
      (replace-regexp-in-string "^\"\\([^\"]+\\)\".*" "\\1" s)
    s))
(defun elot-codelist-id-label (idstring)
  "Given curie IDSTRING, return label if found.
Two-tier lookup: local `elot-codelist-ht' first, then the ELOT label
DB (`elot-db-get-label-any') if available and not found locally."
  (or (and (hash-table-p elot-codelist-ht)
           (elot--strip-lang-tag (gethash idstring elot-codelist-ht)))
      (and (fboundp 'elot-db-get-label-any)
           (fboundp 'sqlite-open)
           (ignore-errors (elot-db-get-label-any idstring)))))
(defun elot-attriblist-label-value (idstring prop)
  "Given label IDSTRING and PROP, return value if found.
Two-tier: local `elot-attriblist-ht' first, then `elot-db-get-attr'
if available."
  (or (and (hash-table-p elot-attriblist-ht)
           (plist-get (gethash idstring elot-attriblist-ht) prop 'equal))
      (and (fboundp 'elot-db-get-attr)
           (fboundp 'sqlite-open)
           (ignore-errors (elot-db-get-attr idstring prop)))))

(defvar elot-codelist-fontify-regexp
  "\\<\\([-a-z_A-Z0-9]*\\):\\([a-z_A-Z0-9.-]*\\)\\>"
  "A regular expression used to match identifiers, for use with label-display.")

(defun elot-update-codelist-fontify-regexp ()
  "Populate `elot-codelist-fontify-regexp'.

• First try to build a tight union-of-identifiers regexp with
  `regexp-opt' and *eagerly* compile it once.
• If compilation signals “regular expression too big” (or any other
  error), fall back to a generic CURIE pattern:

  \"\\\\<\\\\([-a-z_A-Z0-9]*\\\\):\\\\([a-z_A-Z0-9.-]*\\\\)\\\\>\"

This guarantees that the value stored is always usable during
font-lock and export."
  (let ((fallback "\\<\\([-a-z_A-Z0-9]*\\):\\([a-z_A-Z0-9.-]*\\)\\>"))
    (condition-case err
        (progn
          (unless (listp elot-slurp)
            (error "List of resources `elot-slurp' is missing"))

          ;; Build the precise regexp …
          (let* ((ids (flatten-tree (mapcar #'car elot-slurp)))
                 (precise (regexp-opt ids)))

            ;; … and *force* Emacs to compile it once.  Any size error
            ;; happens right here.
            (string-match-p precise "")

            ;; If we got here, it’s safe to use.
            (setq elot-codelist-fontify-regexp precise)))

      (error
       (message "elot: %s – using generic CURIE regexp." (error-message-string err))
       (setq elot-codelist-fontify-regexp fallback)))))
