elot-package/elot-label-display.el

(defvar elot-fontify-keyword nil
  "Variable holding font-lock pattern.")

(defface elot-label-face
  '((t :inherit italic))
  "Default face used to fontify labels in ELOT overlays."
  :group 'elot)

(defcustom elot-label-display-face 'elot-label-face
  "Customizable face used for ELOT label fontification.
You can choose any face (e.g. `italic', `shadow', `underline')"
  :group 'elot
  :version "29.2"
  :type 'face)

(defun elot-update-fontify-keyword ()
  "Update `elot-fontify-keyword' from collected identifier-label pairs."
  (setq elot-fontify-keyword
        `((,elot-codelist-fontify-regexp
           (0
            (unless (memq (get-char-property (match-beginning 0) 'face)
                          org-level-faces)
              ;; bind once per match — match-string and both ht lookups
              (let* ((id    (match-string 0))
                     (label (elot-codelist-id-label id))
                     (rtype (elot-attriblist-label-value label "rdf:type")))
                (put-text-property (match-beginning 0) (match-end 0)
                                   'help-echo
                                   (concat id "  " label "  (" rtype ")"))
                (when (eq elot-label-display 'on)
                  (put-text-property (match-beginning 0) (match-end 0)
                                     'elot-label-display label)
                  (put-text-property (match-beginning 0) (match-end 0)
                                     'face elot-label-display-face)))))))))

(defun elot-add-label-fontification ()
 "Add label fontification to the font-lock list of keywords, then fontify.
The list of keywords is in `elot-fontify-keyword'."
 (progn
   (with-silent-modifications ;; don't mark as edited
     (font-lock-add-keywords
      nil  ; current buffer
      elot-fontify-keyword 'append))
   (font-lock-flush)))

(defun elot-remove-prop-display ()
  "Remove fontification added by `elot-label-display'."
  (remove-text-properties (point-min) (point-max) '(elot-label-display nil)))

(defun elot-label-attribs-query (&optional filter limit)
  "SPARQL query to retrieve (id, label, list of relationships).
Query resources, optionally with FILTER and LIMIT merged into the query."
  (concat
   (elot-prefix-block-from-alist org-link-abbrev-alist-local 'sparql)
   "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl:  <http://www.w3.org/2002/07/owl#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX iof-av: <https://spec.industrialontologies.org/ontology/core/meta/AnnotationVocabulary/>
select distinct ?id ?label ?plist
{ ?id rdfs:label ?label
  filter(lang(?label) = \"\" || lang(?label) = \"en\")    # language should be a user option
  { select ?id
    (concat( group_concat(distinct concat(str(?p), \";;\", str(?o)); separator=\";;\") ) as ?plist)
    where { ?id rdfs:label ?label .
            optional {
              values ?p { rdf:type rdfs:label
                          iof-av:naturalLanguageDefinition dcterms:description skos:definition rdfs:comment }
              ?id ?p ?o .
              filter(!(isBlank(?o))) }
            FILTER isIRI(?id)
            "
   (if filter (concat filter "\n"))
   " } group by ?id ?label }
}"
  (if limit (concat "\nlimit "
                    (if (stringp limit) limit (number-to-string limit) )))))

(defun elot-retrieve-prefixes (uri)
  "Query with SPARQL and return the prefixes.
Prefixes in the query result are returned as a list of (uri, prefix) pairs.
URI is a SPARQL endpoint URL or ontology filename."
  (let ((empty-construct-qry "construct where {?x ?y ?z} limit 0")
        (format ""))
    (with-temp-buffer
      ;; reusing from ELOT customized org-babel-execute:sparql
      (if (string-match-p "^http" uri)  ;; querying an endpoint, or a file?
          (sparql-execute-query empty-construct-qry uri format t)
        (elot-robot-execute-query empty-construct-qry uri 'ttl))
      (mapcar
       (lambda (x)
         (string-match "^\\([^ ]*:\\).*<\\([^>]+\\)>" x)
         (cons (match-string 2 x) (match-string 1 x)))
           (cl-remove ""
                  (split-string
                      (buffer-string)
                      "@prefix +")
                  :test #'equal)))))

(defun elot-replace-strings (str pairs)
  "PAIRS is a list of pairs of strings to replace in string STR."
  (seq-reduce
   (lambda (s pair)
     (string-replace (car pair) (cdr pair) s))
   pairs
   str))

(defun elot-retrieve-labels-plist (url out-file &optional filter limit)
  "Query URL with SPARQL for labels and attributes, optionally FILTER and LIMIT.
Output to OUT-FILE as an elisp list."
  (let ((labels-qry (elot-label-attribs-query filter limit))
        (format "application/sparql-results+json"))
    (with-temp-buffer
      ;; reusing from ELOT customized org-babel-execute:sparql
      (if (string-match-p "^http" url)  ;; querying an endpoint, or a file?
          (sparql-execute-query labels-qry url format t)
        (error "ROBOT ontology-file query not implemented yet for elot labels query"))
        ;; (elot-robot-execute-query labels-qry url 'json)) ; can't output json format
      (let* ((prefixes (elot-retrieve-prefixes url))
             (data-puri (elot-replace-strings (buffer-string) prefixes))
             (bindings (cdr (cadadr (json-read-from-string data-puri)))))
        (with-temp-file (expand-file-name out-file)
          (insert (pp-to-string
           (mapcar (lambda (x)
            (list
             (alist-get 'value (alist-get 'id x))
             (alist-get 'value (alist-get 'label x))
             (string-split
              (alist-get 'value (alist-get 'plist x))
              ";;" t)))
          bindings))))))))

;;(elot-retrieve-labels-plist "http://localhost:3030/bfo-core/query" "~/tmp/bfotest.el")
;;(elot-retrieve-labels-plist "https://www.qudt.org/fuseki/qudt/sparql" "~/tmp/qudttest.el")

(defun elot-read-slurp-global (&rest file-l)
  "FILE-L is a list of files holding elisp lists for label-display."
  (let ((out))
    (cl-loop for l in file-l do
             (setq out
              (append out
               (with-temp-buffer
                 (insert-file-contents (expand-file-name l))
                 (read (buffer-string))))))
    (setq elot-slurp-global out)))

(defun elot-label-display-setup ()
