elot-label-display.org
** Setup toggle variable, keyboard toggle F5, help in minibuffer
Read in the resources, add the fontification, add a toggle variable
and more.
#+name: src-display-setup
#+begin_src emacs-lisp
  (defun elot-label-display-setup ()
    "Read identifier-label pairs and initialise label-display."
    (interactive)
    (progn
      (elot-update-headline-hierarchy)
      (elot-slurp-to-vars)
      (elot-update-codelist-fontify-regexp)
      (elot-update-fontify-keyword)
      (unless (rassoc '(elot-label-display) char-property-alias-alist)
        (push '(display elot-label-display)
              char-property-alias-alist))
      (elot-add-label-fontification)
      (make-local-variable 'elot-label-display)
      (setq elot-label-display 'on)
      ;; use minibuffer to display info about identifier at point.
      ;; set, then activate.
      (setq help-at-pt-display-when-idle t)
      (help-at-pt-set-timer)))
#+end_src
** Toggle label-display
#+name: src-toggle-display
#+begin_src emacs-lisp
  (defun elot-toggle-label-display ()
    "Toggle between showing identifier or rdfs:label, using `elot-label-display'."
    (interactive)
    (with-silent-modifications
      (if (local-variable-p 'elot-label-display)
          (if (eq elot-label-display 'on)
              (progn (elot-remove-prop-display)
                     (setq elot-label-display 'off)
                     (message "ELOT label-display turned off"))
            (progn (font-lock-flush)
                   (setq elot-label-display 'on)
                   (message "ELOT label-display turned on")))
        ;; not active yet, add fontification
        (elot-add-label-fontification))))
#+end_src
** Update labels in save hook
The =after-save-hook= registration for ~elot-slurp-to-vars~ is now
handled by =elot-mode.org= (in the minor-mode definition).  Removed
from here to avoid double-firing.
** Interactive query and insert
*** Search for an identifier by name
NB. This won't work if there are duplicates, i.e., the same label has
been used for more than one resource.

This is the annotation function. Note, this doesn't have access to the
/local/ variable ~elot-slurp~ when executed from the ~completing-read~, so
we ~let~ a temporary version before calling it.
#+name: src-lookup-id-helper
#+begin_src emacs-lisp :results none
  (defvar elot-label-lookup-tmp-attriblist-ht nil
    "Temporary storage for attribute list during label lookup.")

  (defun elot-label-lookup-annotations (label)
    "Helper function for `elot-label-lookup' provides preview string for LABEL."
    (let* ((attrib-plist (gethash label elot-label-lookup-tmp-attriblist-ht))
           (rdf-type (plist-get attrib-plist "rdf:type" 'string=))
           (prefix (car (split-string (plist-get attrib-plist "puri" 'string=) ":")))
           (definition (string-replace "\n" " " (string-limit
                        (or (plist-get attrib-plist "iof-av:naturalLanguageDefinition" 'string=)
                            (plist-get attrib-plist "skos:definition" 'string=)
                            (plist-get attrib-plist "dcterms:description" 'string=)
                            (plist-get attrib-plist "rdfs:comment" 'string=)
                            "")
                        120))))
      (concat
       ;; pad annotations to col 35
       (make-string (max (- 35 (length label)) 0) 32)
       "  "
       prefix
       (make-string (max (- 10 (length prefix)) 0) 32)
       rdf-type
       (make-string (max (- 24 (length rdf-type)) 0) 32)
       definition)))
#+end_src

Then the ~completing-read~ -- rewriting ~elot-label-lookup~ using hashtable.
#+name: src-lookup-id
#+begin_src emacs-lisp
  (defun elot-label-lookup ()
    "Interactive lookup of resource identifier, with completion."
    (interactive)
    (let ((completion-extra-properties
           (append completion-extra-properties
                   '(:annotation-function elot-label-lookup-annotations))))
      ;; Store the attriblist globally so annotation function can access it
      (setq elot-label-lookup-tmp-attriblist-ht elot-attriblist-ht)
      (let ((selected-label
             (completing-read
              "Label: " elot-attriblist-ht)))
        (when selected-label
          (insert " ")     ;; Insert a space to avoid getting stuck under the text property
          (backward-char 1)
          (insert (elot-attriblist-label-value selected-label "puri"))
          (forward-char 1)))))
#+end_src
