elot-package/elot-label-display.el
  "Read identifier-label pairs and initialise label-display."
  (interactive)
  (progn
    (elot-update-headline-hierarchy)
    (elot-slurp-to-vars)
    (elot-update-codelist-fontify-regexp)
    (elot-update-fontify-keyword)
    (unless (rassoc '(elot-label-display) char-property-alias-alist)
      (push '(display elot-label-display)
            char-property-alias-alist))
    (elot-add-label-fontification)
    (make-local-variable 'elot-label-display)
    (setq elot-label-display 'on)
    ;; use minibuffer to display info about identifier at point.
    ;; set, then activate.
    (setq help-at-pt-display-when-idle t)
    (help-at-pt-set-timer)))

(defun elot-toggle-label-display ()
  "Toggle between showing identifier or rdfs:label, using `elot-label-display'."
  (interactive)
  (with-silent-modifications
    (if (local-variable-p 'elot-label-display)
        (if (eq elot-label-display 'on)
            (progn (elot-remove-prop-display)
                   (setq elot-label-display 'off)
                   (message "ELOT label-display turned off"))
          (progn (font-lock-flush)
                 (setq elot-label-display 'on)
                 (message "ELOT label-display turned on")))
      ;; not active yet, add fontification
      (elot-add-label-fontification))))

(defvar elot-label-lookup-tmp-attriblist-ht nil
  "Temporary storage for attribute list during label lookup.")

(defun elot-label-lookup-annotations (label)
  "Helper function for `elot-label-lookup' provides preview string for LABEL."
  (let* ((attrib-plist (gethash label elot-label-lookup-tmp-attriblist-ht))
         (rdf-type (plist-get attrib-plist "rdf:type" 'string=))
         (prefix (car (split-string (plist-get attrib-plist "puri" 'string=) ":")))
         (definition (string-replace "\n" " " (string-limit
                      (or (plist-get attrib-plist "iof-av:naturalLanguageDefinition" 'string=)
                          (plist-get attrib-plist "skos:definition" 'string=)
                          (plist-get attrib-plist "dcterms:description" 'string=)
                          (plist-get attrib-plist "rdfs:comment" 'string=)
                          "")
                      120))))
    (concat
     ;; pad annotations to col 35
     (make-string (max (- 35 (length label)) 0) 32)
     "  "
     prefix
     (make-string (max (- 10 (length prefix)) 0) 32)
     rdf-type
     (make-string (max (- 24 (length rdf-type)) 0) 32)
     definition)))

(defun elot-label-lookup ()
  "Interactive lookup of resource identifier, with completion."
  (interactive)
  (let ((completion-extra-properties
         (append completion-extra-properties
                 '(:annotation-function elot-label-lookup-annotations))))
    ;; Store the attriblist globally so annotation function can access it
    (setq elot-label-lookup-tmp-attriblist-ht elot-attriblist-ht)
    (let ((selected-label
           (completing-read
            "Label: " elot-attriblist-ht)))
      (when selected-label
        (insert " ")     ;; Insert a space to avoid getting stuck under the text property
        (backward-char 1)
        (insert (elot-attriblist-label-value selected-label "puri"))
        (forward-char 1)))))



;;;; -------------------------------------------------------------------
