elot-label-display.org
** Activation for non-ELOT buffers
#+begin_src emacs-lisp
  ;;;; -------------------------------------------------------------------
  ;;;; Step 1.7: Activation for non-ELOT buffers
  ;;;; -------------------------------------------------------------------
  ;;
  ;; `elot-global-label-display-mode' is a general-purpose buffer-local
  ;; minor mode that decorates identifiers in *any* buffer (Turtle,
  ;; SPARQL, CSV, Python, Markdown, shell scripts, etc.) with labels
  ;; drawn from the active label sources recorded in the ELOT DB.
  ;;
  ;; It has no dependency on:
  ;;   - `elot-slurp' being populated in the buffer
  ;;   - prefix tables / CURIE syntax
  ;;   - the buffer's major mode
  ;;
  ;; The font-lock matcher is built from the DB: `regexp-opt' is
  ;; applied to the union of `entities.id' strings across the active
  ;; sources (`elot-db-all-active-ids'), producing a literal-token
  ;; matcher.  This is what lets UC3 buffers (e.g. a Python file
  ;; containing `EMP-12345') get labelled without any language-aware
  ;; tokenising.
  ;;
  ;; Scope limit (v1): matching is literal tokens only.  No capture
  ;; groups, no per-source regex templates, no partial-string
  ;; substitution inside larger tokens.  See the Decisions Log in
  ;; ELOT-DB-PLAN.org.

  (declare-function elot-db-all-active-ids "elot-db"
                    (&optional active-sources include-curies))
  (declare-function elot-db-init "elot-db" (&optional path))

  (defcustom elot-global-label-display-max-ids 10000
    "Soft cap on the number of ids fed to `regexp-opt' by the global mode.
  When `elot-db-all-active-ids' (augmented with CURIE contractions
  in Step 1.7.3) exceeds this value, `elot-global--install' logs a
  warning and installs no matcher; the mode itself stays enabled so
  the toggle UX remains consistent.  Set to nil to disable the cap."
    :type '(choice (integer :tag "Maximum id count")
                   (const :tag "No cap" nil))
    :group 'elot)

  (defvar-local elot-global--fontify-regexp nil
    "Buffer-local regexp used by `elot-global-label-display-mode'.
  Built from `elot-db-all-active-ids' at activation time.")

  (defvar-local elot-global--keywords nil
    "Buffer-local font-lock keywords installed by the global mode.")

  (defconst elot-global--fallback-curie-regexp
    "\\_<\\([-a-z_A-Z0-9]+\\):\\([-a-z_A-Z0-9.]+\\)\\_>"
    "Generic CURIE-shape regexp used when `regexp-opt' produces a pattern
  too large for the Emacs regex engine.  Matches `prefix:localname'
  tokens; the font-lock keyword body then filters via
  `elot-db-get-label-any', so non-entries are cheap no-ops.")

  (defun elot-global--try-compile (regexp)
    "Return REGEXP if it compiles, nil otherwise.
  Forces eager compilation via `string-match-p' so that
  \"regular expression too big\" is caught here rather than later
  inside font-lock."
    (and regexp
         (condition-case _err
             (progn (string-match-p regexp "") regexp)
           (error nil))))

  (defun elot-global--build-regexp (ids)
    "Return a DB-driven font-lock regexp matching literal IDS.
  IDS is a list of strings (entity identifiers), typically IRIs and
  their CURIE contractions.  Tries three tiers:

    1. `regexp-opt' over IDS with symbol boundaries (best coverage).
    2. On compile failure, retry with CURIE-shape entries only
       (IRIs dropped; usually fits because CURIEs share prefixes).
    3. On still-too-big, fall back to a generic CURIE pattern
       (`elot-global--fallback-curie-regexp'); the matcher body
       filters via `elot-db-get-label-any' so false-positive CURIEs
       are no-ops.

  Returns nil when IDS is empty."
    (when ids
      (or (elot-global--try-compile (regexp-opt ids 'symbols))
          (let ((curies (seq-filter
                         (lambda (s)
                           (and (string-match-p ":" s)
                                (not (string-match-p "://" s))))
                         ids)))
            (and curies
                 (elot-global--try-compile (regexp-opt curies 'symbols))))
          (prog1 elot-global--fallback-curie-regexp
            (message
             "elot-global-label-display-mode: %d ids too large for regexp-opt; using generic CURIE fallback"
             (length ids))))))

  (defun elot-global--build-keywords (regexp)
    "Return a font-lock keyword form decorating REGEXP with labels.
  The matcher looks the matched id up via `elot-db-get-label-any'
  and, on a hit, installs the `elot-label-display' text property
  (aliased to `display' via `char-property-alias-alist').  The
  property is only applied when the buffer-local toggle
  `elot-label-display' is `on', so \[elot-toggle-label-display]
  can hide labels without disabling the mode.

  The matcher body is wrapped in `condition-case' so a failing
  lookup cannot silently disable font-lock for the whole buffer
  (Step 1.7.3 safety net)."
    `((,regexp
       (0 (condition-case err
              ;; Capture match-beginning/end BEFORE calling lookup helpers,
              ;; which use `string-match' internally and would otherwise
              ;; clobber the global match data (Step 1.7.3 fix).
              (let* ((mb (match-beginning 0))
                     (me (match-end 0))
                     (id (match-string 0))
                     (label (and (fboundp 'elot-db-get-label-any)
                                 (ignore-errors
                                   (elot-db-get-label-any id)))))
                (when label
                  (put-text-property mb me 'help-echo (concat id "  " label))
                  (when (eq elot-label-display 'on)
                    (put-text-property mb me 'elot-label-display label)
                    (put-text-property mb me 'face
                                       (if (boundp 'elot-label-display-face)
                                           elot-label-display-face
                                         'italic)))))
            (error
             (message "elot-global-label-display-mode: matcher error: %S" err)
             nil))))))

  (defun elot-global--install ()
    "Build regexp + keywords from the DB and install them in this buffer."
    (when (and (fboundp 'elot-db-init)
               (or (not (boundp 'elot-db)) (null elot-db)))
      (ignore-errors (elot-db-init)))
    ;; Ensure the `display' alias is registered so that setting the
    ;; `elot-label-display' text property actually swaps the glyph.
    (unless (rassoc '(elot-label-display) char-property-alias-alist)
      (push '(display elot-label-display) char-property-alias-alist))
    (let* ((ids (and (fboundp 'elot-db-all-active-ids)
                     (ignore-errors (elot-db-all-active-ids nil t))))
           (capped (and elot-global-label-display-max-ids
                        ids
                        (> (length ids) elot-global-label-display-max-ids)))
           (regexp (and ids (not capped)
                        (elot-global--build-regexp ids))))
      (when capped
        (message
         "elot-global-label-display-mode: %d ids exceeds cap of %d; no matcher installed (customize `elot-global-label-display-max-ids')"
         (length ids) elot-global-label-display-max-ids))
      (setq elot-global--fontify-regexp regexp)
      (setq elot-global--keywords
            (and regexp (elot-global--build-keywords regexp)))
      (when elot-global--keywords
        (with-silent-modifications
          (font-lock-add-keywords nil elot-global--keywords 'append))
        (font-lock-flush))))

  (defun elot-global--uninstall ()
    "Remove decorations and font-lock keywords installed by the mode."
    (when elot-global--keywords
      (with-silent-modifications
        (font-lock-remove-keywords nil elot-global--keywords)
        (remove-text-properties (point-min) (point-max)
                                '(elot-label-display nil help-echo nil))))
    (setq elot-global--keywords nil)
    (setq elot-global--fontify-regexp nil)
    (font-lock-flush))

  ;;;###autoload
  (define-minor-mode elot-global-label-display-mode
    "Display labels from ELOT active label sources in any buffer.

  When enabled, identifiers present in the active sources
  (`elot-active-label-sources', usually set via `.dir-locals.el' or
  `M-x elot-label-activate-source') are decorated in place with
  their labels.  Works in any major mode: the font-lock matcher is
  built from the DB, not from a language grammar.

  Toggle with \\[elot-toggle-label-display] (F5) once enabled.  Use
  \\[elot-global-label-display-setup] for a one-shot refresh after
  registering or activating new sources."
    :lighter " ELOT-L"
    (if elot-global-label-display-mode
        (progn
          (elot-global--install)
          (make-local-variable 'elot-label-display)
          (setq elot-label-display 'on)
          (local-set-key (kbd "<f5>") #'elot-toggle-label-display)
          (when (boundp 'elot-active-label-sources-change-hook)
            (add-hook 'elot-active-label-sources-change-hook
                      #'elot-global-label-display-setup nil t)))
      (elot-global--uninstall)
      (setq elot-label-display 'off)
      (when (boundp 'elot-active-label-sources-change-hook)
        (remove-hook 'elot-active-label-sources-change-hook
                     #'elot-global-label-display-setup t))))

  ;;;###autoload
  (defun elot-global-label-display-setup ()
    "One-shot: (re)build the DB-driven font-lock regexp in this buffer.
  Use after registering or activating new label sources to refresh
  decorations without toggling the minor mode off and on."
    (interactive)
    (elot-global--uninstall)
    (elot-global--install)
    (unless elot-global-label-display-mode
      (elot-global-label-display-mode 1)))
#+end_src


** End with "provides"
#+name: src-provide-library
#+begin_src emacs-lisp :comments none
(provide 'elot-label-display)
;;; elot-label-display.el ends here
#+end_src

